app/Http/Controllers/AdminIndustriController.php

select count(*) as aggregate from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_industri', 'surat_keterangan_industri', 'dan_lainnya_industri') and `status` = 'draft'
---
    private function getSuratIndustriData()
    {
        $jenis = [
            'surat_rekomendasi_industri',
            'surat_keterangan_industri',
            'dan_lainnya_industri',
        ];

        return [
            'totalSuratIndustri' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->count(),
            'totalSuratTerverifikasi' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'diterima')->count(),
            'totalSuratDitolak' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'ditolak')->count(),
            'totalSuratDraft' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'draft')->count(),
        ];

select * from `document_user` where `id_permohonan` = '3e1cf0fb-e03f-4141-a15c-e96c98b25629' limit 1
select `file_surat` from `form_permohonan` where `id_permohonan` = '3e1cf0fb-e03f-4141-a15c-e96c98b25629' limit 1
---
    public function viewDokumen($id, $type)
    {
        $dokumen = DB::table('document_user')->where('id_permohonan', $id)->first();

        if (!$dokumen) {
            return abort(404, 'Dokumen tidak ditemukan.');
        }

        $filePath = match (strtoupper($type)) {
            'NIB' => $dokumen->dokument_nib ?? null,
            'NPWP' => $dokumen->npwp ?? null,
            'KTP' => $dokumen->foto_ktp ?? null,
            'AKTA' => $dokumen->akta_perusahaan ?? null,
            'USAHA' => $dokumen->foto_usaha ?? null,
            'SURAT' => DB::table('form_permohonan')->where('id_permohonan', $id)->value('file_surat'),

select * from `data_ikm`
---
    public function showDataIKM()
    {
        $dataIkm = DataIkm::all();