app/Http/Controllers/authController.php

    public function submitFormLogin(Request $request)
    {
        $request->validate([
            'username' => 'required|string',
            'password' => 'required|string',
        ]);

        $identifier = $request->username;

        // 1. Coba login disdag via NIP
        $disdag = Disdag::where('nip', $identifier)->first();
---
select * from `disdag` where `nip` = '731283932910' limit 1



        // 2. Jika tidak ditemukan di disdag, coba login sebagai user
        $user = User::where('nik', $identifier)->orWhere('nib', $identifier)->first();
---
select * from `user` where `nik` = '731283932910' or `nib` = '731283932910' limit 1

            $user->nib = $validated['nib'];

            Log::info('Mencoba menyimpan user ke database');
            $user->save();
---
insert into `user` (`nama`, `jenis_kelamin`, `kabupaten`, `kecamatan`, `kelurahan`, `email`, `telp`, `password`, `alamat_lengkap`, `nik`, `nib`, `updated_at`, `created_at`) values ('Robert Smith Y', 'Laki-laki', 'Kota Parepare', 'Ujung', 'Ujung Sabbang', 'robertsmithy185@gmail.com', '083155990993', '$2y$12$7HN8touTTsw8Kg05qd5CNuKsBlKtjyIyCFkDV.3oV8TaJylmSoMLq', 'jl,singa', '731283932910', '21441', '2025-05-25 16:23:07', '2025-05-25 16:23:07')