app/Http/Controllers/BeritaController.php

    public function show()
    {
        $daftarBerita = Berita::orderBy('tanggal', 'desc')->get();
---
select * from `berita` order by `tanggal` desc