app/Http/Controllers/dashboardPerdaganganController.php

select `barang`.`nama_barang`, `index_kategori`.`nama_kategori` as `kategori_barang`, `index_harga`.`harga` as `harga_satuan`, `index_harga`.`updated_at`, `index_harga`.`tanggal` from `index_harga` inner join `barang` on `index_harga`.`id_barang` = `barang`.`id_barang` inner join `index_kategori` on `index_harga`.`id_index_kategori` = `index_kategori`.`id_index_kategori` order by `index_harga`.`updated_at` desc
select distinct `lokasi` from `index_harga`
---
    public function index(Request $request)
    {
        // Ambil data surat perdagangan
        $rekapSurat = $this->getSuratPerdaganganData();
        $dataSurat = PermohonanSurat::with('user')
            ->whereIn('jenis_surat', ['surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan'])
            ->whereIn('status', ['menunggu', 'ditolak', 'diterima']) // hanya status ini yang ditampilkan
            ->orderBy('created_at', 'desc')
            ->get();

        // Ambil daftar harga barang terbaru (tanpa filter waktu)
        $daftarHarga = DB::table('index_harga')
            ->join('barang', 'index_harga.id_barang', '=', 'barang.id_barang')
            ->join('index_kategori', 'index_harga.id_index_kategori', '=', 'index_kategori.id_index_kategori')
            ->select(
                'barang.nama_barang',
                'index_kategori.nama_kategori as kategori_barang',
                'index_harga.harga as harga_satuan',
                'index_harga.updated_at',
                'index_harga.tanggal'
            )
            ->orderBy('index_harga.updated_at', 'desc')
            ->get();

        // Ambil daftar lokasi unik untuk dropdown
        $daftar_lokasi = DB::table('index_harga')->select('lokasi')->distinct()->pluck('lokasi');

select `tanggal`, `harga` from `index_harga` where `lokasi` = 'Pasar Sumpang' and `tanggal` between '2025-04-25' and '2025-05-25' order by `tanggal` asc
select `tanggal`, `harga` from `index_harga` where `lokasi` = 'Pasar Lakessi' and `tanggal` between '2025-04-25' and '2025-05-25' order by `tanggal` asc
---
        $endDate = Carbon::now()->format('Y-m-d');

        // Ambil data harga per pasar sebulan terakhir
        $dataSumpang = DB::table('index_harga')
            ->where('lokasi', 'Pasar Sumpang')
            ->whereBetween('tanggal', [$startDate, $endDate])
            ->orderBy('tanggal')
            ->get(['tanggal', 'harga']);

        $dataLakessi = DB::table('index_harga')
            ->where('lokasi', 'Pasar Lakessi')
            ->whereBetween('tanggal', [$startDate, $endDate])
            ->orderBy('tanggal')
            ->get(['tanggal', 'harga']);

select
SUM(CASE WHEN UPPER(nama_barang) = "UREA" THEN penyaluran ELSE 0 END) as urea,
SUM(CASE WHEN UPPER(nama_barang) = "NPK" THEN penyaluran ELSE 0 END) as npk,
SUM(CASE WHEN UPPER(nama_barang) = "NPK-FK" THEN penyaluran ELSE 0 END) as npk_fk
from `stok_opname` where year(`tanggal`) = 2025 limit 1
select * from `berita` order by `created_at` desc limit 10
---
        // Tambahkan ini di awal sebelum return view
        $tahunIni = Carbon::now()->year;

        $pupukTahunan = DB::table('stok_opname')
            ->selectRaw('
                SUM(CASE WHEN UPPER(nama_barang) = "UREA" THEN penyaluran ELSE 0 END) as urea,
                SUM(CASE WHEN UPPER(nama_barang) = "NPK" THEN penyaluran ELSE 0 END) as npk,
                SUM(CASE WHEN UPPER(nama_barang) = "NPK-FK" THEN penyaluran ELSE 0 END) as npk_fk
            ')
            ->whereYear('tanggal', $tahunIni)
            ->first();
        $beritaTerbaru = Berita::latest()->take(10)->get();

select * from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan') and `status` in ('menunggu', 'ditolak', 'diterima') order by `created_at` desc
select count(*) as aggregate from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan', 'dan_lainnya_perdagangan') and `status` = 'diterima'
select count(*) as aggregate from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan', 'dan_lainnya_perdagangan') and `status` = 'ditolak'
select count(*) as aggregate from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan', 'dan_lainnya_perdagangan') and `status` = 'draft'
---
    private function getSuratPerdaganganData(){
        $jenis = [
            'surat_rekomendasi_perdagangan',
            'surat_keterangan_perdagangan',
            'dan_lainnya_perdagangan',
        ];

        return [
            'totalSuratPerdagangan' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->count(),
            'totalSuratTerverifikasi' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'diterima')->count(),
            'totalSuratDitolak' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'ditolak')->count(),
            'totalSuratDraft' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'draft')->count(),
        ];

select * from `form_permohonan` where `id_permohonan` = '481495c7-9007-47d5-9a1b-75d28054bf6b' limit 1
select * from `document_user` where `id_permohonan` = '481495c7-9007-47d5-9a1b-75d28054bf6b' limit 1
select * from `user` where `id_user` = 1 limit 1
---
    public function detailSurat($id)
    {
        $data = PermohonanSurat::where('id_permohonan', $id)->first();
        $dokumen = DocumentUser::where('id_permohonan', $id)->first();
        $user = DB::table('user')->where('id_user', $data->id_user)->first();

select * from `document_user` where `id_permohonan` = '481495c7-9007-47d5-9a1b-75d28054bf6b' limit 1
select `file_surat` from `form_permohonan` where `id_permohonan` = '481495c7-9007-47d5-9a1b-75d28054bf6b' limit 1
---
    public function viewDokumen($id, $type)
    {
        $dokumen = DB::table('document_user')->where('id_permohonan', $id)->first();

        if (!$dokumen) {
            return abort(404, 'Dokumen tidak ditemukan.');
        }

        $filePath = match (strtoupper($type)) {
            'NIB' => $dokumen->dokument_nib ?? null,
            'NPWP' => $dokumen->npwp ?? null,
            'KTP' => $dokumen->foto_ktp ?? null,
            'AKTA' => $dokumen->akta_perusahaan ?? null,
            'USAHA' => $dokumen->foto_usaha ?? null,
            'SURAT' => DB::table('form_permohonan')->where('id_permohonan', $id)->value('file_surat'),

select * from `index_kategori`
---
    public function formTambahBarang()
    {
        $kategori = IndexKategori::all();

insert into `index_kategori` (`nama_kategori`, `updated_at`, `created_at`) values ('Beras', '2025-05-25 15:48:50', '2025-05-25 15:48:50')
insert into `barang` (`nama_barang`, `id_index_kategori`, `updated_at`, `created_at`) values ('Beras Premium', 1, '2025-05-25 15:48:50', '2025-05-25 15:48:50')
---
    public function storeBarang(Request $request)
    {
        $request->validate([
            'nama_barang' => 'required|string',
            'kategori_lama' => 'nullable|string',
            'kategori_baru' => 'nullable|string',
        ]);

        $idKategori = null;

        if ($request->kategori_lama === 'tambah_baru' && $request->filled('kategori_baru')) {
            $kategoriBaru = IndexKategori::create([
                'nama_kategori' => $request->kategori_baru,
            ]);
            $idKategori = $kategoriBaru->id_index_kategori;
        } elseif (is_numeric($request->kategori_lama)) {
            $kategoriLama = IndexKategori::find($request->kategori_lama);
            if ($kategoriLama) {
                $idKategori = $kategoriLama->id_index_kategori;
            }
        }

        if (!$idKategori) {
            return back()->withErrors(['kategori' => 'Kategori tidak valid.'])->withInput();
        }

        Barang::create([
            'nama_barang' => $request->nama_barang,
            'id_index_kategori' => $idKategori,
        ]);

select * from `index_kategori` order by `nama_kategori` asc
select * from `barang` order by `nama_barang` asc
---
    public function formUpdateHarga()
    {
        $kategoris = IndexKategori::orderBy('nama_kategori')->get();
        $barangs = Barang::orderBy('nama_barang')->get();

insert into `index_harga` (`id_index_kategori`, `id_barang`, `harga`, `tanggal`, `lokasi`, `updated_at`, `created_at`) values ('1', '1', '30000', '2025-05-23', 'Pasar Lakessi', '2025-05-25 15:49:11', '2025-05-25 15:49:11')
---
    public function update(Request $request)
    {
        $request->validate([
            'id_index_kategori' => 'required|exists:index_kategori,id_index_kategori',
            'id_barang' => 'required|exists:barang,id_barang',
            'harga' => 'required|numeric',
            'tanggal' => 'required|date',
            'lokasi' => 'required|string',
        ]);

        IndexHarga::create([
            'id_index_kategori' => $request->id_index_kategori,
            'id_barang' => $request->id_barang,
            'harga' => $request->harga,
            'tanggal' => $request->tanggal,
            'lokasi' => $request->lokasi,
            'created_at' => now(),
            'updated_at' => now(),
        ]);

select * from `form_permohonan` where `id_user` = 1 and `status` = 'disimpan' order by `created_at` desc
select distinct `kelurahan` from `form_permohonan` where `kelurahan` is not null order by `kelurahan` asc
---
    public function formPermohonan(Request $request)
    {
        $idUser = auth()->guard('user')->id();
        $draftId = $request->query('draft_id'); // Ambil draft_id dari query string

        // Ambil semua draft user (list untuk dropdown)
        $drafts = DB::table('form_permohonan')
            ->where('id_user', $idUser)
            ->where('status', 'disimpan')
            ->orderBy('created_at', 'desc')
            ->get();

        $draft = null;

        // Ambil data lengkap jika draft dipilih
        if ($draftId) {
            $draft = DB::table('form_permohonan as f')
                ->leftJoin('document_user as d', 'f.id_permohonan', '=', 'd.id_permohonan')
                ->where('f.id_user', $idUser)
                ->where('f.id_permohonan', $draftId)
                ->where('f.status', 'disimpan')
                ->select('f.*', 'd.npwp', 'd.akta_perusahaan', 'd.foto_ktp', 'd.foto_usaha', 'd.dokument_nib')
                ->first();
        }

        // Ambil list kelurahan unik (jika masih dibutuhkan)
        $listKelurahan = DB::table('form_permohonan')
            ->select('kelurahan')
            ->distinct()
            ->whereNotNull('kelurahan')
            ->orderBy('kelurahan')
            ->pluck('kelurahan');

update `form_permohonan` set `file_balasan` = 'surat/rekomendasi-987b64a0-6e6c-40a6-af5b-4312f83aa459.pdf', `form_permohonan`.`updated_at` = '2025-05-25 16:03:36' where `id_permohonan` = '21e31171-0165-4c9e-8746-9b566c80a3f7'
---
            $permohonan->file_balasan = "surat/{$filename}";

            // Simpan perubahan ke database (update status dan file_balasan)
            $permohonan->save();

insert into `form_permohonan` (`id_permohonan`, `id_user`, `kecamatan`, `kelurahan`, `jenis_surat`, `titik_koordinat`, `status`, `file_surat`, `tgl_pengajuan`, `updated_at`, `created_at`) values ('c45a950a-a934-4d90-82d3-10748f274e20', 1, 'bacukiki_barat', 'cappa_galung', 'surat_rekomendasi_perdagangan', '-4.023224535629776, 119.63393738026438', 'menunggu', 'DokumentUser/oJzyxtumN0sKJj2DqvoJouz9UhToh3W3Tc3e5xyZ.pdf', '2025-05-26', '2025-05-26 13:47:42', '2025-05-26 13:47:42')
---
                ]);
            } else {
                // Buat baru
                $draft = PermohonanSurat::create([
                    'id_permohonan' => (string) Str::uuid(),
                    'id_user' => $idUser,
                    'kecamatan' => $request->kecamatan,
                    'kelurahan' => $request->kelurahan,
                    'jenis_surat' => $request->jenis_surat,
                    'titik_koordinat' => $request->titik_koordinat,
                    'status' => $status === 'ajukan' ? 'menunggu' : 'disimpan',
                    'file_surat' => $uploadFile('surat'),
                    'tgl_pengajuan' => now()->toDateString(),
                    'created_at' => now(),
                    'updated_at' => now(),
                ]);

insert into `document_user` (`id_permohonan`, `foto_usaha`, `foto_ktp`, `dokument_nib`, `npwp`, `akta_perusahaan`, `updated_at`, `created_at`) values ('c45a950a-a934-4d90-82d3-10748f274e20', 'DokumentUser/7AeM0LddRDEIzL4SnzdlKtcNmi1IC1ho129w86gH.jpg', 'DokumentUser/PaSMNn9Ww4EcyVTbGZEpYD43815GSufBFkIkDU4I.jpg', 'DokumentUser/1hLOm81mw0cPtHVNlIAvzkXBXIaXJi7ZEMvg2jni.pdf', 'DokumentUser/ASyfiO4KAoTbHeydDKOsCDzz1zcjive3k6QhdEbe.pdf', 'DokumentUser/bhiNb405QejjLUAubzDbDo4aYSKJb9hXnAfWKdbm.pdf', '2025-05-26 13:47:42', '2025-05-26 13:47:42')
---
                    'akta_perusahaan' => $uploadFile('akta_perusahaan', $document->akta_perusahaan),
                ]);
            } else {
                DocumentUser::create([
                    'id_permohonan' => $draft->id_permohonan,
                    'foto_usaha' => $uploadFile('foto_usaha'),
                    'foto_ktp' => $uploadFile('foto_ktp'),
                    'dokument_nib' => $uploadFile('dokument_nib'),
                    'npwp' => $uploadFile('npwp'),
                    'akta_perusahaan' => $uploadFile('akta_perusahaan'),
                ]);