app/Http/Controllers/ForumDiskusiController.php

    public function adminForm()
    {
        // Hanya untuk admin (disdag)
        if (!Auth::guard('disdag')->check()) {
            abort(403); // Unauthorized jika bukan disdag
        }

        $chats = ForumDiskusi::with('user', 'disdag')
            ->orderBy('waktu', 'asc')
            ->get();
---
select * from `forum_diskusi` order by `waktu` asc