app/Http/Controllers/homeController.php

    public function index()
    {
        $daftarBerita = Berita::orderBy('tanggal', 'desc')->get();
---
select * from `berita` order by `tanggal` desc

    public function show($judul)
    {
        $judulDecoded = urldecode($judul);
        $berita = Berita::where('judul', $judulDecoded)->firstOrFail();
---
select * from `berita` where `judul` = 'app.js' limit 1