app/Http/Controllers/KabidPerdaganganController.php

select count(*) as aggregate from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan', 'dan_lainnya_perdagangan') and `status` = 'diterima'
select count(*) as aggregate from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan', 'dan_lainnya_perdagangan') and `status` = 'ditolak'
select count(*) as aggregate from `form_permohonan` where `jenis_surat` in ('surat_rekomendasi_perdagangan', 'surat_keterangan_perdagangan', 'dan_lainnya_perdagangan') and `status` = 'draft'
---
    private function getSuratPerdaganganData()
    {
        $jenis = [
            'surat_rekomendasi_perdagangan',
            'surat_keterangan_perdagangan',
            'dan_lainnya_perdagangan',
        ];

        return [
            'totalSuratPerdagangan' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->count(),
            'totalSuratTerverifikasi' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'diterima')->count(),
            'totalSuratDitolak' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'ditolak')->count(),
            'totalSuratDraft' => DB::table('form_permohonan')->whereIn('jenis_surat', $jenis)->where('status', 'draft')->count(),

update `form_permohonan` set `status` = 'diterima', `form_permohonan`.`updated_at` = '2025-05-25 16:05:08' where `id_permohonan` = '21e31171-0165-4c9e-8746-9b566c80a3f7'
---
    public function setujui($id)
    {
        $permohonan = PermohonanSurat::findOrFail($id);

        // Ubah status menjadi 'diterima'
        $permohonan->status = 'diterima';
        $permohonan->save();

select * from `barang` order by `nama_barang` asc
---
    public function analisisPasar(Request $request)
    {
        // Menentukan lokasi pasar yang dipilih, defaultnya adalah 'Pasar Sumpang'
        $lokasi = $request->lokasi ?? 'Pasar Sumpang';

        // Menentukan periode tanggal yang digunakan untuk filter data
        $startDate = $request->start_date ?? now()->subDays(30)->format('Y-m-d');
        $endDate = $request->end_date ?? now()->format('Y-m-d');

        // Inisialisasi variabel yang akan digunakan
        $tanggalList = collect();
        $barangs = Barang::orderBy('nama_barang')->get();

select `harga` from `index_harga` where date(`tanggal`) = '2025-04-25' and `id_barang` = 1 and `lokasi` = 'Pasar Lakessi' limit 1
---
            // Mengambil harga per barang per tanggal dari model IndexHarga
            foreach ($tanggalList as $tanggal) {
                foreach ($barangs as $barang) {
                    $harga = IndexHarga::whereDate('tanggal', $tanggal)
                        ->where('id_barang', $barang->id_barang)
                        ->where('lokasi', $lokasi)
                        ->value('harga');

select `harga` from `index_harga` where `id_barang` = 1 and `lokasi` = 'Pasar Lakessi' and date(`tanggal`) = '2025-05-25' limit 1
---

            // Menyiapkan data harga hari ini
            $barChartData['today'] = $barangs->map(function ($barang) use ($lokasi, $today) {
                return IndexHarga::where('id_barang', $barang->id_barang)
                    ->where('lokasi', $lokasi)
                    ->whereDate('tanggal', $today)  // Mengambil harga hari ini
                    ->value('harga') ?? 0;  // Jika tidak ada harga, set ke 0

select `harga` from `index_harga` where `id_barang` = 1 and `lokasi` = 'Pasar Lakessi' and date(`tanggal`) = '2025-05-24' limit 1
---

            // Menyiapkan data harga kemarin
            $barChartData['yesterday'] = $barangs->map(function ($barang) use ($lokasi, $yesterday) {
                return IndexHarga::where('id_barang', $barang->id_barang)
                    ->where('lokasi', $lokasi)
                    ->whereDate('tanggal', $yesterday)  // Mengambil harga kemarin
                    ->value('harga') ?? 0;  // Jika tidak ada harga, set ke 0

select `toko`.`nama_toko`, `toko`.`no_register`, `stok_opname`.`nama_barang`, SUM(stok_opname.penyaluran) as total_penyaluran from `stok_opname` inner join `toko` on `stok_opname`.`id_toko` = `toko`.`id_toko` inner join `distributor` on `stok_opname`.`id_distributor` = `distributor`.`id_distributor` where `toko`.`kecamatan` = 'Bacukiki Barat' group by `toko`.`id_toko`, `stok_opname`.`nama_barang`, `toko`.`nama_toko`, `toko`.`no_register`
select `stok_opname`.`nama_barang`, SUM(stok_opname.penyaluran) as total from `stok_opname` inner join `toko` on `stok_opname`.`id_toko` = `toko`.`id_toko` where `toko`.`kecamatan` = 'Bacukiki Barat' group by `stok_opname`.`nama_barang`
---
    public function distribusiPupuk(Request $request)
    {
        $kecamatan = $request->input('kecamatan');

        // Query data utama
        $query = DB::table('stok_opname')
            ->join('toko', 'stok_opname.id_toko', '=', 'toko.id_toko')
            ->join('distributor', 'stok_opname.id_distributor', '=', 'distributor.id_distributor');

        if ($kecamatan) {
            $query->where('toko.kecamatan', $kecamatan);
        }

        $data = $query->select(
                'toko.nama_toko',
                'toko.no_register',
                'stok_opname.nama_barang',
                DB::raw('SUM(stok_opname.penyaluran) as total_penyaluran')
            )
            ->groupBy('toko.id_toko', 'stok_opname.nama_barang', 'toko.nama_toko', 'toko.no_register')
            ->get()
            ->groupBy('nama_toko');

        $jumlahToko = $data->count();

        // Data pie chart (total pupuk per jenis)
        $dataPupuk = DB::table('stok_opname')
            ->join('toko', 'stok_opname.id_toko', '=', 'toko.id_toko')
            ->when($kecamatan, function ($query) use ($kecamatan) {
                $query->where('toko.kecamatan', $kecamatan);
            })
            ->select('stok_opname.nama_barang', DB::raw('SUM(stok_opname.penyaluran) as total'))
            ->groupBy('stok_opname.nama_barang')
            ->pluck('total', 'stok_opname.nama_barang');

select YEAR(stok_opname.created_at) as tahun, SUM(penyaluran) as total from `stok_opname` inner join `toko` on `stok_opname`.`id_toko` = `toko`.`id_toko` where `toko`.`kecamatan` = 'Bacukiki Barat' group by YEAR(stok_opname.created_at) order by `tahun` asc
---
        $totalDistribusi = $dataPupuk->sum();

        // 🔵 Data line chart (perkembangan per tahun)
        $dataPerTahun = DB::table('stok_opname')
            ->join('toko', 'stok_opname.id_toko', '=', 'toko.id_toko')
            ->when($kecamatan, function ($query) use ($kecamatan) {
                $query->where('toko.kecamatan', $kecamatan);
            })
            ->select(DB::raw('YEAR(stok_opname.created_at) as tahun'), DB::raw('SUM(penyaluran) as total'))
            ->groupBy(DB::raw('YEAR(stok_opname.created_at)'))
            ->orderBy('tahun')
            ->get();