app/Http/Controllers/PelaporanController.php

    public function index(Request $request)
    {
        $userId = session('id_user');
        $distributor = Distributor::where('id_user', $userId)->first();

        if (!$distributor) return redirect()->route('pelaporan-penyaluran');
        if ($distributor->status === 'menunggu' || $distributor->status === 'ditolak') {
            return redirect()->route('cekpengajuan');
        }
        $tokoview = Toko::where('id_distributor', $distributor->id_distributor)->get();
        $tokos = Toko::where('id_distributor', $distributor->id_distributor)->paginate(3);

        $bulan = $request->input('bulan', now()->month);
        $tahun = $request->input('tahun', now()->year);
        $tokoId = $request->input('toko');

        $query = StokOpname::where('id_distributor', $distributor->id_distributor)
            ->whereYear('tanggal', $tahun)
            ->whereMonth('tanggal', $bulan);

        if (!empty($tokoId)) {
            $query->where('id_toko', $tokoId);
        }

        $stokOpnames = $query->get();
---
select * from `distributor` where `id_user` = 1 limit 1
select * from `toko` where `id_distributor` = 1
select * from `toko` where `id_distributor` = 1 limit 3 offset 0
select count(*) as aggregate from `toko` where `id_distributor` = 1
select * from `stok_opname` where `id_distributor` = 1 and year(`tanggal`) = '2025' and month(`tanggal`) = '05' and `id_toko` = '1'

    public function verifikasiPengajuan()
    {
        // Ambil id_user dari session
        $id_user = Session::get('id_user');

        // Ambil data status dari tabel distributor
        $distributor = DB::table('distributor')
                        ->where('id_user', $id_user)
                        ->orderByDesc('created_at') // kalau ada lebih dari 1 data
                        ->first();
---
select * from `distributor` where `id_user` = 1 order by `created_at` desc limit 1

    public function submitDistributor(Request $request)
    {
        try {
            // Validasi input
            $request->validate([
                'dokumen_nib' => 'required|file|mimes:pdf|max:51200',
            ]);

            // Ambil ID pengguna dari session
            $userId = session('id_user');

            if (!$userId) {
                return redirect()->back()->with('error', 'User tidak ditemukan dalam sesi.');
            }

            // Upload file
            $file = $request->file('dokumen_nib');
            $fileName = time() . '_' . $file->getClientOriginalName();
            $path = $file->storeAs('nib_dokumen', $fileName, 'public');

            // Perbarui data jika id_user sudah ada, atau buat baru jika belum
            Distributor::updateOrCreate(
                ['id_user' => $userId], // Kondisi
                ['nib' => $path, 'status' => 'Menunggu'] // Data yang akan diupdate/ditambahkan
            );
---
select * from `user` where `user`.`id_user` in (1)
insert into `distributor` (`id_user`, `nib`, `status`, `updated_at`, `created_at`) values (1, 'nib_dokumen/1748186740_Tugas Diskusi ERD.pdf', 'Menunggu', '2025-05-25 15:25:40', '2025-05-25 15:25:40')
select * from `distributor` where (`id_user` = 1) limit 1

    public function reviewPengajuanDistributor()
{
    $distributor = Distributor::with('user')->latest()->get(); // mengambil semua data termasuk user
---
select * from `distributor` order by `created_at` desc

    public function setujui($id_distributor)
    {
        $distributor = Distributor::findOrFail($id_distributor);
        $distributor->status = 'diterima';
        $distributor->save();
---
select * from `distributor` where `distributor`.`id_distributor` = '1' limit 1
update `distributor` set `status` = 'diterima', `distributor`.`updated_at` = '2025-05-25 15:41:00' where `id_distributor` = 1

    public function tolak($id_distributor)
    {
        $distributor = Distributor::findOrFail($id_distributor);
        $distributor->status = 'ditolak';
        $distributor->save();
---
select * from `distributor` where `distributor`.`id_distributor` = '1' limit 1
update `distributor` set `status` = 'ditolak', `distributor`.`updated_at` = '2025-05-25 15:34:13' where `id_distributor` = 1

    public function inputDataToko(Request $request)
    {
        // Validasi input
        $request->validate([
            'nama_toko' => 'required|string|max:255',
            'kecamatan' => 'required|string|max:255',
            'no_register' => 'required|string|max:100',
            'rencana_kebutuhan' => 'required|numeric',
            'tahun' => 'required|digits:4|integer|min:2000|max:' . date('Y'),
        ]);

        try {
            DB::beginTransaction();

            // Ambil id_user dari session
            $id_user = session('id_user');
            if (!$id_user) {
                return back()->with('error', 'User belum login.');
            }

            // Cari distributor berdasarkan id_user
            $distributor = \App\Models\Distributor::where('id_user', $id_user)->first();

            if (!$distributor) {
                return back()->with('error', 'Distributor untuk user ini tidak ditemukan.');
            }

            // Simpan ke rencana_kebutuhan_distributor
            $rencana = RencanaKebutuhanDistributor::create([
                'jumlah' => $request->input('rencana_kebutuhan'),
                'tahun' => $request->input('tahun'),
                'id_barang_pelaporan' => null,
            ]);

            // Simpan ke tabel toko dengan foreign key ke rencana kebutuhan dan distributor
            Toko::create([
                'id_rancangan' => $rencana->id_rancangan,
                'id_distributor' => $distributor->id_distributor,
                'nama_toko' => $request->input('nama_toko'),
                'kecamatan' => $request->input('kecamatan'),
                'no_register' => $request->input('no_register'),
            ]);
---
select * from `distributor` where `id_user` = 1 limit 1
insert into `rencana_kebutuhan_distributor` (`jumlah`, `tahun`, `id_barang_pelaporan`, `updated_at`, `created_at`) values ('1000', '2025', null, '2025-05-25 15:41:20', '2025-05-25 15:41:20')
insert into `toko` (`id_rancangan`, `id_distributor`, `nama_toko`, `kecamatan`, `no_register`, `updated_at`, `created_at`) values (1, 1, 'Uceng Tani', 'Bacukiki Barat', '0921334', '2025-05-25 15:41:20', '2025-05-25 15:41:20')

    public function inputDataDistribusi(Request $request)
    {
        $userId = session('id_user');
        $distributor = Distributor::where('id_user', $userId)->first();

        if (!$distributor) {
            return redirect()->back()->with('error', 'Distributor tidak ditemukan.');
        }

        $request->validate([
            'id_toko' => 'required|exists:toko,id_toko',
            'nama_barang' => 'required|string',
            'stok' => 'required|integer|min:0',
            'penyaluran' => 'required|integer|min:0',
            'tanggal_input' => 'required|date',
        ]);

        $tanggalInput = Carbon::parse($request->tanggal_input);
        $mingguInput = $this->getMingguKe($tanggalInput);

        // Ambil semua entri sebelumnya (bulan yang sama) untuk kombinasi distributor + toko + barang
        $entriesThisMonth = StokOpname::where('id_distributor', $distributor->id_distributor)
            ->where('id_toko', $request->id_toko)
            ->where('nama_barang', $request->nama_barang)
            ->whereYear('tanggal', $tanggalInput->year)
            ->whereMonth('tanggal', $tanggalInput->month)
            ->get();
---
select * from `distributor` where `id_user` = 1 limit 1
select * from `stok_opname` where `id_distributor` = 1 and `id_toko` = '3' and `nama_barang` = 'NPK' and year(`tanggal`) = 2025 and month(`tanggal`) = '05'

        $stokAkhir = $stokAwal - $penyaluran;

        // Simpan ke database
        StokOpname::create([
            'id_distributor' => $distributor->id_distributor,
            'id_toko' => $request->id_toko,
            'stok_awal' => $stokAwal,
            'penyaluran' => $penyaluran,
            'stok_akhir' => $stokAkhir,
            'tanggal' => $tanggalInput->toDateString(),
            'nama_barang' => $request->nama_barang,
        ]);
---
insert into `stok_opname` (`id_distributor`, `id_toko`, `stok_awal`, `penyaluran`, `stok_akhir`, `tanggal`, `nama_barang`, `updated_at`, `created_at`) values (1, '3', '120', '110', 10, '2025-05-01', 'NPK', '2025-05-25 15:44:01', '2025-05-25 15:44:01')

    public function showDataDistribusi($id_toko)
    {
        // Cari data toko berdasarkan id
        $toko = Toko::findOrFail($id_toko);
---
select * from `toko` where `toko`.`id_toko` = '1' limit 1