app/Http/Controllers/PelaporanController.php

update `distributor` set `nib` = 'nib_dokumen/1748187269_Tugas Diskusi ERD.pdf', `status` = 'Menunggu', `distributor`.`updated_at` = '2025-05-25 15:34:29' where `id_distributor` = 1
---
    public function tolak($id_distributor)
    {
        $distributor = Distributor::findOrFail($id_distributor);
        $distributor->status = 'ditolak';
        $distributor->save();