app/Http/Controllers/SobatHargaController.php

    public function index($kategori)
    {
        // Ambil data kategori berdasarkan nama
        $kategoriData = IndexKategori::where('nama_kategori', 'like', '%' . $kategori . '%')->firstOrFail();

        // Ambil barang berdasarkan id kategori
        $barangs = Barang::where('id_index_kategori', $kategoriData->id_index_kategori)->get();

        // Lokasi yang tersedia
        $lokasiList = ['Pasar Sumpang', 'Pasar Lakessi'];

        $daftarHarga = [];

        // Range tanggal 6 hari terakhir (termasuk hari ini)
        $endDate = Carbon::today();
        $startDate = Carbon::today()->subDays(5);

        $rangeTanggal = collect();
        for ($date = $startDate->copy(); $date->lte($endDate); $date->addDay()) {
            $rangeTanggal->push($date->copy());
        }

        foreach ($barangs as $barang) {
            $namaBarang = $barang->nama_barang;
            $daftarHarga[$namaBarang] = [];

            foreach ($lokasiList as $lokasi) {
                // Ambil histori harga dalam rentang tanggal dan cocokkan berdasarkan tanggal string
                $histori = IndexHarga::where('id_barang', $barang->id_barang)
                    ->where('lokasi', $lokasi)
                    ->whereBetween('tanggal', [
                        $startDate->format('Y-m-d'),
                        $endDate->format('Y-m-d')
                    ])
                    ->get()
                    ->keyBy(fn($item) => Carbon::parse($item->tanggal)->toDateString());
---
select * from `index_kategori` where `nama_kategori` like '%beras%' limit 1
select * from `barang` where `id_index_kategori` = 1
select * from `index_harga` where `id_barang` = 1 and `lokasi` = 'Pasar Sumpang' and `tanggal` between '2025-05-20' and '2025-05-25'

        }

        // Ambil semua kategori
        $semuaKategori = IndexKategori::orderBy('id_index_kategori')->get();
---
select * from `index_kategori` order by `id_index_kategori` asc