app/Http/Controllers/UserHalalController.php

select * from `sertifikasi_halal` order by `tanggal_sah` desc
---
    public function index(Request $request)
    {
        $keyword = $request->keyword;

        $data = SertifikasiHalal::when($keyword, function ($query) use ($keyword) {
            $query->where('nama_usaha', 'like', '%' . $keyword . '%')
                  ->orWhere('no_sertifikasi_halal', 'like', '%' . $keyword . '%')
                  ->orWhere('alamat', 'like', '%' . $keyword . '%');
        })
        ->orderBy('tanggal_sah', 'desc')
        ->get();